
&НаКлиенте
Процедура Заполнить(Команда)
	
	Если НЕ ЗначениеЗаполнено(ГрафикРаботы) Тогда
		ТекстСообщения = "Не выбран график работы.";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВыборПериода) Тогда
		ТекстСообщения = "Не заполнен период заполнения графика.";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;	
	КонецЕсли;
	
	ЗаполнитьНаСервере();
	ОбщегоНазначенияКлиент.СообщитьПользователю("Заполнение завершено");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьГрафик(ВыборПериода.ДатаНачала, ВыборПериода.ДатаОкончания, ВыходныеДни, ГрафикРаботы);
	
КонецПроцедуры
