
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция УведомленияДляОтправки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_УведомленияТелеграмБоту.Ссылка,
	|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивСообщений = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураСообщений = Новый Структура;
		СтруктураСообщений.Вставить("Ссылка", Выборка.Ссылка);
		СтруктураСообщений.Вставить("ТекстСообщения", Выборка.ТекстСообщения);
		МассивСообщений.Добавить(СтруктураСообщений);
		
	КонецЦикла;
	
	Возврат МассивСообщений;	
		
КонецФункции

#КонецОбласти	
	
#КонецЕсли