
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// регистр ВКМ_ГрафикОтпусков
	Движения.ВКМ_ГрафикОтпусков.Записывать = Истина;
	Для Каждого ТекущаяСтрокаТЧ Из ОтпускаСотрудников Цикл 
		
		Движение = Движения.ВКМ_ГрафикОтпусков.Добавить();
		Движение.Регистратор = Ссылка;
		Движение.Сотрудник = ТекущаяСтрокаТЧ.Сотрудник;
		Движение.ДатаНачала = ТекущаяСтрокаТЧ.ДатаНачала;
		Движение.ДатаОкончания = ТекущаяСтрокаТЧ.ДатаОкончания;
		Движение.Год = Период;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли