
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИзменениеВидимостиЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)	
	ИзменениеВидимостиЭлементов();	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИзменениеВидимостиЭлементов() Экспорт

	Если Запись.Подразделение = ПредопределенноеЗначение("Справочник.ВКМ_Подразделения.АдминистративныйПерсонал") Тогда
		Элементы.ПроцентОтРабот.Видимость = Ложь;
		Запись.ПроцентОтРабот = 0;
	КонецЕсли;
	
	Если Запись.Подразделение = ПредопределенноеЗначение("Справочник.ВКМ_Подразделения.Специалисты") Тогда
		Элементы.ПроцентОтРабот.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти