
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ОбработчикиСобытий  

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
       
    Для Каждого ТекСтрокаСписокСотрудников Из СписокСотрудников Цикл 
        
        // регистр ВКМ_ДополнительныеНачисления
        Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
        Движение.Сторно = Ложь;
        Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксПремия;
        Движение.ПериодРегистрации = Дата;
        Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
        Движение.БазовыйПериодКонец = КонецМесяца(Дата);
        Движение.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
        Движение.Результат = ТекСтрокаСписокСотрудников.СуммаПремии;
        
        // регистр ВКМ_Удержания	
        ДвижениеУдержания = Движения.ВКМ_Удержания.Добавить();
        ДвижениеУдержания.Сторно = Ложь;
        ДвижениеУдержания.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
        ДвижениеУдержания.ПериодРегистрации = Дата;
        ДвижениеУдержания.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
        ДвижениеУдержания.Результат = Окр(ТекСтрокаСписокСотрудников.СуммаПремии * 0.13, 2);
        
        // регистр ВКМ_ВзаиморасчетыССотрудниками Приход
        ДвижениеВзаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
        ДвижениеВзаиморасчеты.ВидДвижения = ВидДвиженияНакопления.Приход;
        ДвижениеВзаиморасчеты.Период = Дата;
        ДвижениеВзаиморасчеты.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксПремия;
        ДвижениеВзаиморасчеты.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
        ДвижениеВзаиморасчеты.Сумма = ТекСтрокаСписокСотрудников.СуммаПремии;
        
    КонецЦикла;
    
    Движения.ВКМ_ДополнительныеНачисления.Записать(); 
    Движения.ВКМ_Удержания.Записать();
    Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();

КонецПроцедуры 

#КонецОбласти

#КонецЕсли