
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВывестиГруппуАбоненскоеОбслуживаниеНаФорму(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВывестиГруппуАбоненскоеОбслуживаниеНаФорму(ЭтотОбъект);
КонецПроцедуры 

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиГруппуАбоненскоеОбслуживаниеНаФорму(ВКМ_Форма)

	Если ВКМ_Форма.Объект.ВидДоговора = 
		ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		
		ВКМ_Форма.Элементы.ГруппаАбоненскоеОбслуживание.Видимость = Истина;
						
	Иначе
		
		ВКМ_Форма.Элементы.ГруппаАбоненскоеОбслуживание.Видимость = Ложь;	
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти 


