
Процедура ОбработкаПроведения(Отказ, Режим)
    
    Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
                                                 
    Для Каждого ТекСтрокаВыплаты Из Выплаты Цикл 
        
        // регистр ВКМ_ВзаиморасчетыССотрудниками Расход
        Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
        Движение.Период = НачалоМесяца(Дата) - 60*60*24;
        Движение.Сотрудник = ТекСтрокаВыплаты.Сотрудник;
        Движение.Сумма = ТекСтрокаВыплаты.Сумма;
        
    КонецЦикла; 
    
КонецПроцедуры
