
// ВКМ_ИзмененияНачало

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Таблица = Элементы.Список;
	Колонка = Таблица.ПодчиненныеЭлементы.Найти("Ссылка");
	
	ПолеНачалоДоговора = Элементы.Вставить("_ДатаНачалаДействияДоговора", Тип("ПолеФормы"), Таблица, Колонка);
	ПолеНачалоДоговора.Заголовок = "Начало договора";
	ПолеНачалоДоговора.ПутьКДанным = "Список.Ссылка.ВКМ_ДатаНачалаДействияДоговора"; 
	
	ПолеКонецДоговора = Элементы.Вставить("_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"), Таблица, Колонка);
	ПолеКонецДоговора.Заголовок = "Окончание договора";
	ПолеКонецДоговора.ПутьКДанным = "Список.Ссылка.ВКМ_ДатаОкончанияДействияДоговора";  
	
	ПолеАбоненскаяПлата = Элементы.Вставить("_СуммаАбонентскойПлаты", Тип("ПолеФормы"), Таблица, Колонка);
	ПолеАбоненскаяПлата.Заголовок = "Абоненская плата";
	ПолеАбоненскаяПлата.ПутьКДанным = "Список.Ссылка.ВКМ_СуммаАбонентскойПлаты";
	
	ПолеСтоимостьЧаса = Элементы.Вставить("_СтоимостьЧасаРаботыСпециалиста", Тип("ПолеФормы"), Таблица, Колонка);
	ПолеСтоимостьЧаса.Заголовок = "Стоимость часа";
	ПолеСтоимостьЧаса.ПутьКДанным = "Список.Ссылка.ВКМ_СтоимостьЧасаРаботыСпециалиста";
	
КонецПроцедуры 

// ВКМ_ИзмененияКонец
